#+TITLE: Emacs Lisp: Foundational Utility Packages
#+DATE: 29 April 2021

**** Partition
     #+begin_src elisp
       (-partition 2 '("dog" "cat" "pig" "cow" "elephant"))
     #+end_src

     #+RESULTS:
     | dog | cat |
     | pig | cow |

     compare vs seq:
     #+begin_src elisp
       (seq-partition '("dog" "cat" "pig" "cow" "elephant") 2)
     #+end_src

     #+RESULTS:
     | dog      | cat |
     | pig      | cow |
     | elephant |     |

